	   IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       AUTHOR. XAVIER_GEERINCK.
      *ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  BOVENGRENS    PIC 99     VALUE 0.
       01  COUNTER       PIC 99     VALUE 0.
       PROCEDURE DIVISION.
       MAINLINE.
           DISPLAY "ENTER THE FIRST NUMBER (UNDER 100)".
           ACCEPT BOVENGRENS

           PERFORM TELLEN
              UNTIL COUNTER = BOVENGRENS.
           STOP RUN.
       TELLEN.
           ADD 1 TO COUNTER
           DISPLAY "Number: " COUNTER.